In [1]:
#Groupby allows you to group togather rows based of a column and then perform aggregate function

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {'Company': ['Goog', 'Goog', 'msft', 'fb', 'fb'],
       'Person': ['Sap', 'Sam', 'Amy', 'Vanessa', 'Carl'],
        'Sales': [200, 120, 288,366, 244]
       }

In [4]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    Goog      Sap    200
1    Goog      Sam    120
2    msft      Amy    288
3      fb  Vanessa    366
4      fb     Carl    244

In [5]:
byCom = df.groupby('Company') 
byCom.mean() #ignores non-numeric

         Sales
Company
Goog     160.0
fb       305.0
msft     288.0

In [6]:
byCom.sum()

         Sales
Company
Goog       320
fb         610
msft       288

In [7]:
byCom.std()

             Sales
Company
Goog     56.568542
fb       86.267027
msft           NaN

In [9]:
byCom.sum().loc['fb']

Sales    610
Name: fb, dtype: int64

In [11]:
df.groupby('Company').sum().loc['fb'] #in oneline

Sales    610
Name: fb, dtype: int64

In [12]:
df.groupby('Company').count()

         Person  Sales
Company
Goog          2      2
fb            2      2
msft          1      1

In [13]:
df.groupby('Company').max()

          Person  Sales
Company
Goog         Sap    200
fb       Vanessa    366
msft         Amy    288

In [14]:
df.groupby('Company').min()

        Person  Sales
Company
Goog       Sam    120
fb        Carl    244
msft       Amy    288

In [15]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
Goog      2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0
fb        2.0  305.0  86.267027  244.0  274.5  305.0  335.5  366.0
msft      1.0  288.0        NaN  288.0  288.0  288.0  288.0  288.0

In [19]:
df.groupby('Company').describe().transpose()['fb']

Sales  count      2.000000
       mean     305.000000
       std       86.267027
       min      244.000000
       25%      274.500000
       50%      305.000000
       75%      335.500000
       max      366.000000
Name: fb, dtype: float64